[
    {
        "id": 1,
        "projectName": "AeroTrip",
        "projectType": "OTA-B2B Platform",
        "image1": "https://i.ibb.co.com/287kjYm/aerotrip.png",
        "liveLink": "https://b2b.aerotrip.net",
        "clientCode": "",
        "serverCode": "",
        "overview": "AeroTrip is a B2B Online Travel Agency platform designed to enhance the workflow of travel agencies through efficient booking management tools, providing a seamless booking experience for agents and travelers.",
        "desc": [
            "Designed responsive interfaces for agent registration, login, and traveler management to improve agent onboarding and streamline daily operations.",
            "Developed features for ticket booking, issuing, voiding, and canceling, along with options to add services such as food and baggage, optimizing workflow and increasing booking accuracy.",
            "Integrated GDS airline data with advanced filtering options and infinite scrolling for a seamless user experience, allowing agents to access a wider variety of flights quickly.",
            "Built secure, validated forms using Formik and Yup, with consistent UI elements using Tailwind CSS, ensuring ease of use and reducing booking errors."
        ],
        "outcome": "Delivered a high-quality frontend that significantly improved the booking workflow, resulting in a number of reduction in agent errors and increased efficiency in booking management.",
        "challenges": "One challenge was integrating GDS airline data with advanced filtering options, which required optimizing the performance of infinite scrolling to ensure smooth data loading. This was solved by implementing lazy loading techniques.",
        "technology": "TypeScript, Next.js, Redux, RTK Query, Tailwind CSS, Formik, Yup"
    },
    {
        "id": 2,
        "projectName": "Automart",
        "projectType": "E-commerce Platform",
        "image1": "https://i.ibb.co.com/nccBSFR/Automart.png",
        "liveLink": "https://automart.com.bd/",
        "clientCode": "",
        "serverCode": "",
        "overview": "Automart is a fully featured e-commerce platform providing an engaging and smooth shopping experience for customers, with an emphasis on intuitive cart management and quick checkout.",
        "desc": [
            "Designed the product catalog with increment/decrement options for managing shopping cart items, ensuring ease of use during the shopping experience.",
            "Implemented a custom order confirmation modal and checkout functionality, reducing cart abandonment and improving conversion rates.",
            "Leveraged Laravel and MySQL for backend order management and data storage, while using jQuery for additional frontend interactivity, enhancing overall user experience."
        ],
        "outcome": "Built a responsive and engaging e-commerce platform that saw increase in checkout completion rates and improved user satisfaction through intuitive navigation.",
        "challenges": "Integrating secure payment gateways like bKash and Nagad with the system involved overcoming backend issues related to API compatibility, which was resolved by thorough testing and debugging.",
        "technology": "React, jQuery, PHP (Laravel), MySQL, Bootstrap, HTML, CSS"
    },
    {
        "id": 3,
        "projectName": "Photo Book",
        "projectType": "Photo Gallery Application",
        "image1": "https://i.ibb.co.com/qgyxZN6/Photo-book-12-31-2024-11-23-PM.png",
        "liveLink": "https://photo-book-mi.netlify.app/",
        "clientCode": "https://github.com/majharul-web/photo-book-client",
        "serverCode": "https://github.com/majharul-web/photo-book-server",
        "overview": "Photo Book is a personal project offering an interactive platform for users to share and engage with photos. It enables browsing, liking, and commenting on user-uploaded images.",
        "desc": [
            "Created a photo gallery interface where users can browse, like, and comment on photos, enhancing user interaction and engagement.",
            "Integrated secure Google and email-based login via Firebase for user authentication, ensuring a safe user environment.",
            "Built responsive layouts with Daisy UI and Tailwind CSS, providing a visually appealing and responsive experience across devices.",
            "Developed a backend with Express.js and MongoDB to manage user data, posts, likes, and comments efficiently."
        ],
        "outcome": "Delivered an interactive photo-sharing platform that fosters social engagement.",
        "challenges": "One challenge was optimizing the backend to handle traffic, which was mitigated by implementing data pagination and optimizing database queries.",
        "technology": "JavaScript, TypeScript, React, Redux, Tailwind CSS, Daisy UI, Firebase, MongoDB, Express.js, Node.js"
    },
    {
        "id": 4,
        "projectName": "Cloudone",
        "projectType": "Company Branding Website",
        "image1": "https://i.ibb.co.com/tY15V5H/Cloudone.png",
        "liveLink": "https://www.cloudone.com.bd/",
        "clientCode": "",
        "serverCode": "",
        "overview": "Cloudone is a company branding website designed to showcase corporate identity and services with a focus on user engagement and brand presence.",
        "desc": [
            "Implemented features like 'Refer A Friend' with Ajax for dynamic user engagement, pre-registration, and app QR code scanning for easy access to services.",
            "Created a responsive, mobile-first interface, ensuring the site was user-friendly across all devices, leading to better user interaction."
        ],
        "outcome": "The website successfully improved brand visibility and engagement, leading to increase in new user sign-ups.",
        "challenges": "The major challenge was ensuring the website’s responsiveness across all devices, which was resolved by using a mobile-first design approach and thorough testing.",
        "technology": "PHP (Laravel), MySQL, Bootstrap, HTML, CSS, jQuery"
    },
    {
        "id": 5,
        "projectName": "Aliba International",
        "projectType": "E-commerce Platform",
        "image1": "https://i.ibb.co.com/QQbbZsr/alibaint.png",
        "liveLink": "https://alibainternational.com/",
        "clientCode": "",
        "serverCode": "",
        "overview": "Aliba International is an e-commerce platform offering a streamlined shopping experience with integrated cart and wishlist management, authentication, and secure payment gateways.",
        "desc": [
            "Designed the UI and implemented API connections for shopping cart and wishlist management, simplifying the purchasing process for users.",
            "Integrated authentication and payment gateways like bKash and Nagad, alongside coupon and discount features, enhancing the overall shopping experience."
        ],
        "outcome": "Built a modern, user-friendly e-commerce website that led to increase in sales and improvement in user retention due to its intuitive interface and checkout process.",
        "challenges": "Integrating the payment gateway with a smooth user experience was challenging, but extensive testing ensured secure and seamless transactions.",
        "technology": "React, React-Redux, PHP (Laravel), MySQL, Bootstrap, HTML, CSS"
    }
]